Repository: codesource/typo3-cdsrc_bepwreset
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# headline.reset
source: Reset password form
de: Password zurücksetzen Formular

# labels.backToLogin
source: Back to login form
de: Zurück zum Login

# labels.changePasswordAtFirstLogin
source: Your password must be updated.
de: Ihr Passwort muss aktualisiert werden

# labels.passwordForgotten
source: Password forgotten?
de: Passwort vergessen?

# labels.password_confirmation
source: Password confirmation
de: Passwort Bestätigung

# labels.requestPasswordChange
source: Request a password change
de: Passwortänderung anfordern

# labels.reset
source: Save password
de: Passwort speichern

# labels.reset.process
source: Saving password ...
de: Speichere Passwort ...

# labels.resetpw
source: Send reset code
de: Passwort zurücksetzen Code zusenden

# labels.switchToReset
source: Switch to password reset
de: Zu Passwort zurücksetzen wechseln

# ok.resetPassword
source: Your password has been changed
de: Ihr Passwort wurde geändert

# ok.resetPasswordMessage
source: You can login with your new password.
de: Sie können sich nun mit dem neuen Passwort anmelden

# ok.sendCode
source: Reset code sent
de: Code zum Zurücksetzen wurde gesendet

# ok.sendCodeMessage
source: A confirmation has been send to your address email. Click on link to finish password reset.
de: Eine Bestätigung wurde an Ihre E-Mail Adresse geesendet. Klicken Sie den Link um den Vorgang abzuschliessen.

# requestNewPassword.subject
source: [%s] Password reset request
de: [%s] Passwort Änderung Anfrage

# warning.resetPassword
source: An error happend during reset processing
de: Ein Fehler ist während dem Zurücksetzen aufgetreten

# warning.resetPassword.invalidResetCode
source: Given reset code is invalid.
de: Der Zurücksetzen Code ist ungültig.

# warning.resetPassword.invalidUserEmail
source: User's email address is invalid, please contact an administrator
de: Die E-Mail Adresse des Benutzers ist ungültig. Bitte kontaktieren Sie einen Administrator

# warning.resetPassword.userDoNotExists
source: Given username is invalid, please try again.
de: Der gewählte Benutzername ist ungültig.

# warning.resetPassword.userHasNoEmail
source: User has no email address defined, please contact an administrator
de: Der Benutzer hat keine E-Mail Adresse hinterlegt. Bitte kontaktieren Sie einen Administrator

# warning.resetPassword.userIsInBlackList
source: This user is not allowed to reset his password.
de: Dieser Benutzer ist nicht berechtigt sein Passwort zurückzusetzen.

# warning.resetPassword.userIsNotInBlackList
source: This user is not allowed to reset his password.
de: Dieser Benutzer ist nicht berechtigt sein Passwort zurückzusetzen.
